# Заменит ли ChatGPT программистов?

Задачи для проверки искусственного "интеллекта".

## Hello, world

Ниже вы видите буквы английского алфавита в стилистике ASCII Art.
Напишите программу, которая напечатает HELLO WORLD этими буквами.
Расстояние между буквами в словах — два пробела, как на рисунке.
Расстояние между словами — шесть пробелов.

```text
 ***   ****    ****  ****   *****  *****
*   *  *   *  *      *   *  *      *
*****  ****   *      *   *  ****   ****
*   *  *   *  *      *   *  *      *
*   *  ****    ****  ****   *****  *


 ****  *   *  ***  *****  *   *  *
*      *   *   *       *  *  *   *
*   *  *****   *       *  ***    *
*   *  *   *   *   *   *  *  *   *
 ****  *   *  ***   ***   *   *  *****


*     *  *   *   ***   ****    ***   ****
**   **  **  *  *   *  *   *  *   *  *   *
* * * *  * * *  *   *  ****   *   *  ****
*  *  *  *  **  *   *  *      *   *  *  *
*     *  *   *   ***   *       ***** *   *


 ***   *****  *   *  *   *  *     *  *   *
*        *    *   *  *   *  *  *  *   * *
 ***     *    *   *  *   *  * * * *    *
    *    *    *   *   * *   **   **   * *
 ***     *     ***     *    *     *  *   *

*   *  *****
 * *      *
  *      *
  *     *
  *    *****
```

Эталонная реализация:

```c#
Console.WriteLine("*   *  *****  *      *       ***       *     *   ***   ****   *      ****");
Console.WriteLine("*   *  *      *      *      *   *      *  *  *  *   *  *   *  *      *   *");
Console.WriteLine("*****  ****   *      *      *   *      * * * *  *   *  ****   *      *   *");
Console.WriteLine("*   *  *      *      *      *   *      **   **  *   *  *  *   *      *   *");
Console.WriteLine("*   *  *****  *****  *****   ***       *     *   ***   *   *  *****  ****");
```
